Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་གཟི་བརྗིད་རྣམ་པར་གྲགས་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Famed King of the Splendor of All Jewels will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ལྔ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་ཁྲི་ཕྲག་རེ་རེའོ། །
en: There will be fifty consecutive congregations, each of them gathering one hundred billion.

source: དེ་བཞིན་གཤེགས་པ་དོན་ལ་གནས་པའི་བློ་མངའ་བ་སྐྱེ་བའི་ཡུལ་ནི་དོན་མཐའ་ཡས་པའི་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Sthitārtha­buddhi will be born in a place called Array of Infinite Meaning.

source: ཡབ་ནི་དོན་གྱི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Ultimate King will be his father.

source: ཡུམ་ནི་སེམས་ཅན་གྱི་དོན་ལ་རྣམ་པར་གདོན་མི་ཟ་བའི་རྒྱལ་མོ་ཞེས་བྱའོ། །
en: Queen Free from Doubt about the Welfare of Sentient Beings will be his mother.

source: སྲས་ནི་རིན་པོ་ཆེའི་མཛོད་ཅེས་བྱའོ། །
en: Jewel Treasury will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་འབུམ་ཕྲག་སྙེད་འཆང་བའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor That Holds Hundreds of Thousands of Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཕས་ཀྱི་རྒོལ་བ་ཚར་གཅོད་པ་ཞེས་བྱའོ། །
en: Eliminator of Enemy Attacks will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་བརྩེགས་པའི་རྣ་རྒྱན་གྱིས་བརྒྱན་པ་ཞེས་བྱའོ། །
en: Adorned with the Earrings of Compiled Wisdom will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ལྔ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བཅུ་བཅུའོ། །
en: There will be fifty consecutive congregations, each of them gathering ten billion.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ལྔ་ཁྲི་སུམ་སྟོང་ངོ་། །
en: The extent of his lifespan will be fifty-three thousand years.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་ལྔ་ཁྲི་སུམ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for fifty-three thousand years.

source: དེ་བཞིན་གཤེགས་པ་སྣང་བའི་འོད་ཟེར་སྐྱེ་བའི་ཡུལ་ནི་སྣང་བ་མཐའ་ཡས་པའི་གཟི་བརྗིད་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Ābhāsaraśmi will be born in a place called Splendid Array of Infinite Light.

source: ཡབ་ནི་སྣང་བ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་ཞེས་བྱའོ། །
en: Adorned with All Light will be his father.

source: ཡུམ་ནི་ཡེ་ཤེས་སྣང་བའི་འོད་ཀྱི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of the Radiant Light of Wisdom will be his mother.

source: སྲས་ནི་གཟི་བརྗིད་ཀྱི་ཕུང་པོའི་འོད་རྣམ་པར་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed Light of Aggregated Splendor will be his son.

source: རིམ་གྲོ་པ་ནི་བློའི་ཡེ་ཤེས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Mind’s Wisdom will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློའི་རྣམ་པར་ངེས་པ་ཞེས་བྱའོ། །
en: Certainty of the Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲགས་པ་རྫོགས་པའི་རྒྱལ་མཚན་གྱི་ཏོག་ཅེས་བྱའོ། །
en: Victory Banner Crest of Perfect Fame will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བདུན་བདུན་ནོ། །
en: There will be seventy consecutive congregations, each of them gathering seven hundred million.

source: དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་གཟི་བརྗིད་སྐྱེ་བའི་ཡུལ་ནི་ཨ་ག་རུའི་དྲི་བསུང་གིས་ངེས་པར་བདུགས་པའི་གཟི་བརྗིད་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Gandhatejas will be born in a place called Splendid Light Perfumed by the Fragrance of Agarwood.

source: འོད་ནི་དཔག་ཚད་ཙམ་མོ། །
en: His light will extend one league.

source: ཡབ་ནི་མཐའ་ཡས་སྤོས་འོད་ཅེས་བྱའོ། །
en: Light of Infinite Fragrances will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་བརྒྱའི་སྤོས་འོད་མ་ཞེས་བྱའོ། །
en: Light of the Fragrance of a Hundred Qualities will be his mother.

source: སྲས་ནི་སྤོས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོའི་བློ་ཅན་སེམས་ཞེས་བྱའོ། །
en: Mind with the Intelligence of the Royal Master of Fragrances will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་སྤོས་འོད་བློ་ཞེས་བྱའོ། །
en: Mind of Luminous Qualities and Fragrance will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཙན་དན་དྲི་བསུང་ཞིམ་པོའི་ཉི་མའི་འོད་ཅེས་བྱའོ། །
en: Sunlight of Sweet Fragrant Sandalwood will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྤོས་ཀྱི་གཟི་བརྗིད་རྣམ་པར་སྣང་བར་བྱེད་པའི་འོད་ཅེས་བྱའོ། །
en: Illuminating Light of Splendent Fragrances will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བཅུ་དྲུག་བཅུ་དྲུག་གོ། །
en: There will be sixteen consecutive congregations, each of them gathering one hundred sixty million.

source: དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་དགའ་བར་མཛད་པའི་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་རིན་པོ་ཆེ་མཐོང་བས་ངོམས་པར་བྱེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Saṃtoṣaṇa will be born in a place called Satisfying Sight of Precious Qualities.

source: ཡབ་ནི་བདུད་རྩིའི་དབྱངས་ཀྱིས་སེལ་བ་ཞེས་བྱའོ། །
en: Purified by the Melody of Nectar will be his father.

source: ཡུམ་ནི་ངག་འཇམ་བརྗོད་པའི་ཚིག་ཅན་ཞེས་བྱའོ། །
en: Speaker of Gentle Words will be his mother.

source: སྲས་ནི་ལྟ་བ་གསལ་བའི་ལུས་ཞེས་བྱའོ། །
en: Body of Clear View will be his son.

source: རིམ་གྲོ་པ་ནི་ཆོག་ཤེས་ཡོན་ཏན་གཟི་བརྗིད་འོད་ཅེས་བྱའོ། །
en: Radiant Light of the Qualities of Contentment will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡན་ལག་ཡེ་ཤེས་ཀྱིས་ཚིམ་པ་གྱ་ནོམ་སེམས་པ་ཞེས་བྱའོ། །
en: Limbs of the Intention of Sublime Satisfaction of Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཡོ་བ་མེད་པར་གནས་པས་ཕས་ཀྱི་རྒོལ་བ་རབ་ཏུ་འཇོམས་པ་ཞེས་བྱའོ། །
en: Unquivering Crusher of Attacks will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་རྩ་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་ཁྲི་ཕྲག་བཅུ་དྲུག་བཅུ་དྲུག་གོ། །
en: There will be ninety-eight consecutive congregations, each of them gathering one hundred sixty thousand.

source: དེ་བཞིན་གཤེགས་པ་དོན་ཡོད་པར་གཤེགས་པ་སྐྱེ་བའི་ཡུལ་ནི་སྒྲིབ་པ་མེད་པའི་གཟི་བརྗིད་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Amoghagāmin will be born in a place called Array of Unobscured Splendor.

source: ཡབ་ནི་ཡིད་གཉིས་རྣམ་པར་འཐོར་བའི་གཟི་བརྗིད་ཕྲུག་གུ་ཞེས་བྱའོ། །
en: Child of the Splendid Scattering of Doubts will be his father.

source: ཡུམ་ནི་ཤེས་རབ་ཀྱི་སྣང་བ་རྣམ་པར་ངེས་པ་ཞེས་བྱའོ། །
en: Ascertaining the Light of Insight will be his mother.

source: སྲས་ནི་ཕྱོགས་ལྟ་བཟོད་ཅེས་བྱའོ། །
en: Patience with Partial Views will be his son.

source: རིམ་གྲོ་པ་ནི་ཤེས་རབ་ཀྱི་སྣང་བ་བྱེད་ཅེས་བྱའོ། །
en: Illuminating Insight will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདེན་སྒྲ་རྣམ་པར་སྒྲོགས་པ་ཞེས་བྱའོ། །
en: Proclaimer of the Truth will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟིལ་གྱིས་མི་ནོན་པའི་ཏོག་གི་རྒྱལ་མཚན་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Indomitable Royal Crest Banner will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་ཅུ་རྩ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be sixty-six consecutive congregations, each of them gathering six hundred million.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དྲུག་ཁྲི་བརྒྱད་སྟོང་ངོ་། །
en: The extent of his lifespan will be sixty-eight thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཁྲོ་བ་བཅོམ་པ་སྐྱེ་བའི་ཡུལ་ནི་ཐ་བའི་ཚེར་མ་མེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Bhasmakrodha will be born in a place called Free from the Thorns of Defilement.

source: འོད་ནི་དཔག་ཚད་བཞི་སྟོང་ངོ་། །
en: His light will extend four thousand leagues.

source: ཡབ་ནི་མུན་བྲལ་ཞེས་བྱའོ། །
en: Free from Darkness will be his father.

source: ཡུམ་ནི་བྱམས་སེམས་མཐོང་ཞེས་བྱའོ། །
en: Sight of the Mind of Love will be his mother.

source: སྲས་ནི་ཡོན་ཏན་ཕུང་པོ་ཞེས་བྱའོ། །
en: Heap of Qualities will be his son.

source: རིམ་གྲོ་པ་ནི་སྐྱོན་མེད་སྦྱིན་ཞེས་བྱའོ། །
en: Flawless Gift will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒྱགས་པའི་སྐྱོན་ཞི་བར་གནས་པ་ཞེས་བྱའོ། །
en: Abiding by the Pacification of the Flaws of Arrogance will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཞི་གནས་དང་དུལ་བར་གནས་པའི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Adherence to Calm Abiding and Discipline will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགྲ་བཅོམ་པ་བྱེ་བ་ཕྲག་བདུན་ཅུའོ། །གཉིས་པ་ལ་ནི་བྱེ་བ་ཕྲག་བརྒྱད་ཅུའོ། །གསུམ་པ་ལ་ནི་བྱེ་བ་ཕྲག་དགུ་བཅུའོ། །བཞི་པ་ལ་ནི་ཐེར་འབུམ་མོ། །
en: In the first congregation there will be seven hundred million worthy ones; in the second there will be eight hundred million; in the third, nine hundred million; and in the fourth, one billion.

source: དེ་བཞིན་གཤེགས་པ་གཟུགས་མཆོག་སྐྱེ་བའི་ཡུལ་ནི་ཡན་ལག་དམ་པ་རིན་པོ་ཆེ་མཆོད་གནས་ཞེས་བྱའོ། །
en: “The thus-gone Vararūpa will be born in a place called Precious and Holy Elements That Are Objects of Worship.

source: འོད་ནི་དཔག་ཚད་དགུ་བཅུ་རྩ་དྲུག་གོ། །
en: His light will extend ninety-six leagues.

source: ཡབ་ནི་རིན་པོ་ཆེའི་གཟི་བརྗིད་ཕུང་པོ་ཞེས་བྱའོ། །
en: Splendid Heap of Jewels will be his father.

source: ཡུམ་ནི་འཇིག་རྟེན་པའི་གཟུགས་ཐམས་ཅད་ཀྱིས་ཟིལ་གྱིས་མི་ནོན་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor That Cannot Be Outshone by Any Mundane Form will be his mother.

source: སྲས་ནི་གཟུགས་བྱིན་ཞེས་བྱའོ། །
en: Form Gift will be his son.

source: རིམ་གྲོ་པ་ནི་གཟུགས་ཀྱི་བརྡ་སྒྲུབ་པར་སེམས་པ་ཞེས་བྱའོ། །
en: Mind Intent on Accomplishing the Symbols of Form will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འོད་ཟེར་གྱི་གཟི་བརྗིད་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Blooming Flowers of Radiant Splendor will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཟུགས་ཀྱི་བརྡ་སྒྲུབ་པ་ཕ་རོལ་ཏུ་ཕྱིན་པར་སེམས་པ་ཞེས་བྱའོ། །
en: Mind Intent on Perfecting the Accomplishment of the Symbols of Form will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་བཅུ་བཞི་བཅུ་བཞིའོ། །
en: There will be eighty consecutive congregations of worthy ones, each of them gathering one million four hundred thousand.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་དྲུག་ཁྲི་བརྒྱད་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for sixty-eight thousand years.

source: དེ་བཞིན་གཤེགས་པ་ལེགས་གཤེགས་སྐྱེ་བའི་ཡུལ་ནི་འགྲོས་ཆེན་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Sukrama will be born in a place called Array of the Great Mode.

source: ཡབ་ནི་འགྲོས་མཛེས་སེམས་པ་ཞེས་བྱའོ། །
en: Intent on the Beautiful Mode will be his father.

source: ཡུམ་ནི་ཁྱུ་མཆོག་མིག་མཐོང་འགྲོས་ཞེས་བྱའོ། །
en: Mode of Seeing the Eye of the Leader will be his mother.

source: སྲས་ནི་དབང་པོའི་མཚོན་ཆ་འགྲོས་ཀྱིས་བྱིན་ཞེས་བྱའོ། །
en: Giving by Advancing with the Weapons of the Faculties will be his son.

source: རིམ་གྲོ་པ་ནི་ཆུ་བོའི་རྒྱལ་པོ་སུམ་ཅུ་སེང་གེའི་བདག་པོ་ལུས་ཞེས་བྱའོ། །
en: Body of the Lion Lords and Thirty River Kings will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསྐལ་པ་གྲངས་མེད་པ་ནས་ཡང་དག་པར་བསྒྲུབས་པའི་བློ་ཅན་ཞེས་བྱའོ། །
en: Possessor of the Mind That Accomplishes Authentic Practices throughout Innumerable Eons will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྩོན་པ་མི་གཏོང་ཞིང་བཀོད་པ་ཆེན་པོ་རྟག་པ་ཞེས་བྱའོ། །
en: Unrelenting Diligence and the Constant Array of Greatness will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་ལྔ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གཉིས་གཉིས་སོ། །
en: There will be twenty-five consecutive congregations of worthy ones, each of them gathering two hundred million.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་ཉི་ཁྲི་བརྒྱད་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for twenty-eight thousand years.

source: དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་སྦྱིན་པར་གྲགས་པ་སྐྱེ་བའི་ཡུལ་ནི་གྲགས་པ་མཐའ་ཡས་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: “The thus-gone Pradānakīrti will be born in a place called Banner of Infinite Renown.

source: ཡབ་ནི་མཐུ་རྩལ་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed Power will be his father.

source: ཡུམ་ནི་གྲགས་པ་མཐའ་ཡས་འཛིན་ཞེས་བྱའོ། །
en: Holder of Infinite Renown will be his mother.

source: སྲས་ནི་གྲགས་པ་ཀུན་ཏུ་འཕགས་པ་ཞེས་བྱའོ། །
en: Exalted Renown will be his son.

source: རིམ་གྲོ་པ་ནི་གྲགས་ཆེན་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Great Fame will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲགས་མཆོག་གསལ་བ་ཞེས་བྱའོ། །
en: Clarity of Supreme Renown will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཞན་གྲགས་དད་བྱེད་ཡང་དག་འཕགས་ཞེས་བྱའོ། །
en: Truly Superior Instiller of Faith and Renown among Others will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅྭ་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be eighteen consecutive congregations of hearers, each of them gathering one billion.

source: དེ་བཞིན་གཤེགས་པ་འོད་གཙང་སྐྱེ་བའི་ཡུལ་ནི་འཕགས་པ་གཟིགས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Śuddhaprabha will be born in a place called Vision of the Noble.

source: ཡབ་ནི་ཡང་དག་དོན་སེམས་ཞེས་བྱའོ། །
en: Mind of True Meaning will be his father.

source: ཡུམ་ནི་བདུད་རྩིའི་སེམས་ཞེས་བྱའོ། །
en: Mind of Nectar will be his mother.

source: སྲས་ནི་དུས་བྱིན་དབྱངས་ཞེས་བྱའོ། །
en: Time-Given Melody will be his son.

source: རིམ་གྲོ་པ་ནི་སྒྲ་དང་བརྡ་ཟད་མི་ཤེས་པ་འཛིན་པ་ཞེས་བྱའོ། །
en: Holder of Inexhaustible Language and Signs will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དཔུང་གི་ཚོགས་རབ་ཏུ་འཇོམས་པ་ཞེས་བྱའོ། །
en: Army Conqueror will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཕས་ཀྱི་རྒོལ་བ་རྣམ་པར་འཇིག་པ་ལ་དཔའ་བ་ཞེས་བྱའོ། །
en: Bold Destroyer of Attacks will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་བཅྭ་བརྒྱད་དེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བཅུ་བདུན་བཅུ་བདུན་ནོ། །
en: There will be eighteen consecutive congregations of worthy ones, each of them gathering seven hundred million.

source: དེ་བཞིན་གཤེགས་པ་ལྷའི་ཉི་མ་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་མཐའ་ཡས་པའི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Devasūrya will be born in a place called Light of Infinite Splendor.

source: ཡབ་ནི་འོད་འཕགས་ཞེས་བྱའོ། །
en: Superior Light will be his father.

source: ཡུམ་ནི་སྣང་བ་མཐའ་ཡས་བཀོད་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendid Array of Infinite Light will be his mother.

source: སྲས་ནི་འཇིག་རྟེན་ཐམས་ཅད་ན་མཛེས་པ་ཞེས་བྱའོ། །
en: Beauty in All Worlds will be his son.

source: རིམ་གྲོ་པ་ནི་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་བསྔགས་པར་སེམས་པ་ཞེས་བྱའོ། །
en: Intent on Praise by the Entire World will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མངོན་པར་ཤེས་པ་ཡོན་ཏན་རིན་པོ་ཆེ་ཞེས་བྱའོ། །
en: Precious Qualities of Superknowledge will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་བརྡ་འཛིན་པ་ཞེས་བྱའོ། །
en: Holder of the Symbols of All Qualities will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་ལྔ་བཅུ་རྩ་དྲུག་དྲུག་གོ། །
en: There will be seventy consecutive congregations of worthy ones, each of them gathering five hundred sixty million.

source: དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་བྱིན་སྐྱེ་བའི་ཡུལ་ནི་ཤེས་རབ་སྐར་མདའ་ཅན་ཞེས་བྱའོ། །
en: “The thus-gone Prajñādatta will be born in a place called Possessor of the Meteor of Insight.

source: ཡབ་ནི་ཤེས་རབ་སྐར་མདས་མངོན་པར་ཤེས་པའི་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ཞེས་བྱའོ། །
en: Blooming Flower of Superknowledge through the Meteor of Insight will be his father.

source: ཡུམ་ནི་ལུས་ཤིན་ཏུ་རྣམ་པར་འབྱེས་པ་འོད་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: Infinitely Luminous Bodily Beauty will be his mother.

source: སྲས་ནི་ཤེས་རབ་རྣམ་པར་ངེས་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Ascertaining Insight will be his son.

source: རིམ་གྲོ་པ་ནི་ཤེས་རབ་ཀྱིས་རྣམ་པར་བསྒོམས་ཤིང་སྦྱངས་པའི་སེམས་ཞེས་བྱའོ། །
en: Mind Trained and Purified through Insight will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མ་འཁྲུགས་ཤིང་ཤེས་རབ་བརྩེགས་པའི་འགྲོས་ཞེས་བྱའོ། །
en: Unperturbed Progression of Peak Insight will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤིན་ཏུ་རྣམ་པར་ངེས་པའི་རི་བོ་ཞེས་བྱའོ། །
en: Mountain of Thorough Ascertainment will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་དྲུག་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བཅུ་བཅུའོ། །
en: There will be sixty consecutive congregations of worthy ones, each of them gathering ten billion.

source: དེ་བཞིན་གཤེགས་པ་མཉམ་པར་བཞག་པའི་བདག་ཉིད་སྐྱེ་བའི་ཡུལ་ནི་ཀུན་ནས་གནས་པར་གྲགས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Samāhitātman will be born in a place called Famed Abiding.

source: ཡབ་ནི་ཞི་གནས་རྙེད་ཅིང་ཐོབ་པ་ཞེས་བྱའོ། །
en: Discovering and Attaining Calm Abiding will be his father.

source: ཡུམ་ནི་སེམས་ལ་གཡོ་བ་མེད་པ་ཞེས་བྱའོ། །
en: Unmoving Mind will be his mother.

source: སྲས་ནི་བདུད་རྩི་དྲན་པའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendid Nectar of Recollection will be his son.

source: རིམ་གྲོ་པ་ནི་ཐར་པ་རིན་པོ་ཆེའི་སྣོད་བློ་ཅན་ཞེས་བྱའོ། །
en: Possessor of the Mind That Is the Vessel of Precious Liberation will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགེ་བའི་སེམས་ལ་རབ་ཏུ་ཞི་བའི་འགྲོས་ལ་གནས་པ་ཞེས་བྱའོ། །
en: Dwelling in the Serenity Mode of Virtuous Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཡོ་བ་མེད་པའི་གོ་འཕང་རྣམ་པར་གནོན་པའི་སེམས་ཞེས་བྱའོ། །
en: Mind That Accomplishes the Immutable Stage will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be eighty consecutive congregations of worthy ones, each of them gathering one billion.

source: དེ་བཞིན་གཤེགས་པ་གཟི་མདངས་སྐྱེ་བའི་ཡུལ་ནི་ཡོན་ཏན་མདངས་འགྲོ་ཞེས་བྱའོ། །
en: “The thus-gone Ojastejas will be born in a place called Movement of Bright Qualities.

source: ཡབ་ནི་ཏོག་མཆོག་གཟི་བརྗིད་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Supreme Crest of Royal Splendor will be his father.

source: ཡུམ་ནི་ཡེ་ཤེས་སྣང་བ་སྦྱིན་པ་ཞེས་བྱའོ། །
en: Gift of the Light of Wisdom will be his mother.

source: སྲས་ནི་ནོར་ལྷ་གསལ་བ་ཞེས་བྱའོ། །
en: Luminous Wealth God will be his son.

source: རིམ་གྲོ་པ་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཏོག་གི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Crest Banner of Heaps of Merit will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྒྲོན་མའི་ཕུང་པོ་ཆེན་པོ་ཞེས་བྱའོ། །
en: Great Lamp Aggregate will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆགས་པ་མེད་པའི་མཐའ་ལས་ངེས་པར་འབྱུང་བའི་བློ་ཅན་ཞེས་བྱའོ། །
en: Possessor of the Mind That Emerges from the Limit of Detachment will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be thirty consecutive congregations of worthy ones, each of them gathering one trillion.

source: དམ་པའི་ཆོས་ནི་ལོ་བདུན་ཁྲི་བཞི་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for seventy-four thousand years.

source: དེ་བཞིན་གཤེགས་པ་རྒྱལ་རིགས་སྐྱེ་བའི་ཡུལ་ནི་རྒྱལ་པོའི་དྲང་སྲོང་ཕྲུག་གུ་ཞེས་བྱའོ། །
en: “The thus-gone Kṣatriya will be born in a place called Child of the Royal Sage.

source: ཡབ་ནི་བསོད་ནམས་འབྱོར་པའི་ཏོག་ཅེས་བྱའོ། །
en: Crest of the Riches of Merit will be his father.

source: ཡུམ་ནི་བསོད་ནམས་འགྲོས་ཞེས་བྱའོ། །
en: Mode of Merit will be his mother.

source: སྲས་ནི་ཡུལ་འཁོར་ཆོས་དགེ་ཞེས་བྱའོ། །
en: Land of Dharma Virtue will be his son.

source: རིམ་གྲོ་པ་ནི་རྒྱལ་སྲིད་འཕེལ་བར་བྱེད་པའི་བློ་ཅན་ཞེས་བྱའོ། །
en: Wisdom Possessor Who Expands the Realm will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་སྟོབས་བྱིན་ཞེས་བྱའོ། །
en: Power Gift will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཟླ་བཞིན་དོན་ཡོད་མཆོག་ཅེས་བྱའོ། །
en: Moon-Like Supreme Accomplisher will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་རྩ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བཅུ་བཞི་བཅུ་བཞིའོ། །
en: There will be eighty-four consecutive congregations, each of them gathering fourteen billion.

source: དེ་བཞིན་གཤེགས་པ་སྐལ་ལྡན་ཤིང་རྟ་སྐྱེ་བའི་ཡུལ་ནི་འཇིགས་པ་མེད་པའི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Bhāgīrathi will be born in a place called Light of Fearlessness.

source: ཡབ་ནི་ཆུ་ལྷས་བྱིན་ཞེས་བྱའོ། །
en: Gift of the Water God will be his father.

source: ཡུམ་ནི་ལྟ་བས་མཐོང་ཞེས་བྱའོ། །
en: Vision through the View will be his mother.

source: སྲས་ནི་མི་ཟད་པའི་ཏོག་ཅེས་བྱའོ། །
en: Inexhaustible Crest will be his son.

source: རིམ་གྲོ་པ་ནི་ཤིན་ཏུ་འཕགས་སེམས་ཞེས་བྱའོ། །
en: Extremely Noble Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྟ་བ་གསལ་ཞེས་བྱའོ། །
en: Clear View will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐེ་ཚོམ་མེད་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Intelligence Free from Doubt will be foremost in terms of miraculous abilities.

source: ཉན་ཐོས་འདུས་པ་ནི་ལན་ལྔ་བཅུ་རྩ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་དྲུག་དྲུག་གོ། །
en: There will be fifty-six consecutive congregations of hearers, each of them gathering six hundred million.

source: དེ་བཞིན་གཤེགས་པ་གསེར་མཆོག་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Suvarṇottama will be born in a place called Supreme Splendor.

source: ཡབ་ནི་རིན་པོ་ཆེའི་འོད་ཅེས་བྱའོ། །
en: Jewel Light will be his father.

source: ཡུམ་ནི་བཻ་དཱུརྱའི་འོད་ཅེས་བྱའོ། །
en: Beryl Light will be his mother.

source: སྲས་ནི་རིན་ཆེན་ཡོངས་དག་ཅེས་བྱའོ། །
en: Perfectly Pure Jewel will be his son.

source: རིམ་གྲོ་པ་ནི་རིན་ཆེན་འབྱུང་གནས་ཞེས་བྱའོ། །
en: Source of Jewels will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་མཐའ་ཡས་སྒྲོགས་ཞེས་བྱའོ། །
en: Proclamation of Limitless Jewels will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་ཐམས་ཅད་མངོན་པར་ཤེས་པ་ཞེས་བྱའོ། །
en: Superknowledge of All Jewels will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བཅུ་བདུན་ཏེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་གཉིས་གཉིས་སོ། །
en: There will be seventeen consecutive congregations of worthy ones, each of them gathering two billion.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་ཉི་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for twenty thousand years.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གྲོལ་བའི་གཙུག་སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་མཐོང་ཞེས་བྱའོ། །
en: “The thus-gone Vimuktacūḍa will be born in a place called Sight of Joy.

source: ཡབ་ནི་རྨོག་གྱོན་ཞེས་བྱའོ། །
en: Helmet Bearer will be his father.

source: ཡུམ་ནི་ཉི་མ་གསལ་བྱེད་ཅེས་བྱའོ། །
en: Illuminating Sun will be his mother.

source: སྲས་ནི་ཏོག་གི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Crest Banner will be his son.

source: རིམ་གྲོ་པ་ནི་ཆགས་མེད་སེམས་ཞེས་བྱའོ། །
en: Mind of Detachment will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་གཡོ་བ་མེད་པར་གནས་པ་ཞེས་བྱའོ། །
en: Abiding by Unshakable Power will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འོད་མཆོག་ཁ་ལོ་སྒྱུར་བ་ཞེས་བྱའོ། །
en: Leader of Supreme Light will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བཞི་བཅུ་རྩ་གཅིག་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་བཞི་བཞིའོ། །
en: There will be forty-one consecutive congregations of worthy ones, each of them gathering four million.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ལྡན་སྐྱེ་བའི་ཡུལ་ནི་ཆོས་ཀྱི་སྐར་མདའ་སྣང་བ་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Dhārmika will be born in a place called Endowed with the Light of Shooting Dharma Stars.

source: ཡབ་ནི་རིན་པོ་ཆེའི་སྒྲོན་མ་ཞེས་བྱའོ། །
en: Jewel Lamp will be his father.

source: ཡུམ་ནི་བྱང་ཆུབ་དད་ཅེས་བྱའོ། །
en: Faith in Awakening will be his mother.

source: སྲས་ནི་འགྲོ་བའི་འོད་ཟེར་ཞེས་བྱའོ། །
en: Radiance for Wandering Beings will be his son.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདུད་རྩིའི་བཅུད་ཀྱི་ཏོག་ཅེས་བྱའོ། །
en: Crest of Nectar Essence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འགྲོ་དད་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of the Faith of Wandering Beings will be foremost in terms of miraculous abilities.

source: དགྲ་བཅོམ་པ་འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་དྲུག་དྲུག་གོ། །
en: There will be eighty consecutive congregations of worthy ones, each of them gathering eight hundred sixty million.

source: དེ་བཞིན་གཤེགས་པ་སྤོས་གནས་སྐྱེ་བའི་ཡུལ་ནི་འགྲོ་བ་ཐམས་ཅད་དད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Sthitagandha will be born in a place called Faith of All Beings.

source: འོད་ནི་དཔག་ཚད་བཅུ་བདུན་ནོ། །
en: His light will extend seventeen leagues.

source: ཡབ་ནི་གནས་དང་གནས་མ་ཡིན་པ་སྤོང་བ་ཞེས་བྱའོ། །
en: Relinquishment of Fact and Nonfact will be his father.

source: ཡུམ་ནི་རྟོགས་པའི་དོན་ལ་གནས་པ་འདོར་བ་ལྡོག་པར་བྱེད་པ་ཞེས་བྱའོ། །
en: Stopping the Loss of Adherence to the Realized Meaning of will be his mother.

source: སྲས་ནི་འགྲོ་བ་ཐམས་ཅད་མི་འབྱུང་བར་གྱུར་པ་ཞེས་བྱའོ། །
en: Cessation of All Transmigration will be his son.
